<template>
  <el-container class="since">
    <LeftSide></LeftSide>
    <el-main class="ex-cont">
        <p>佛说：前世五百次回眸，才能换来今生的擦肩而过。如果真是如此，那我愿意用这辈子，下辈子，下下辈子，下下下辈子的时间，再次换来与你相遇、相知、相爱！</p>
        <div class="love-cont">
            <img src="../assets/flower.jpg" alt="" class="f-img" />
            <p>
                北鼻，首先祝你新年快乐！这是第一次我给你做的一个小网站，
                不过我只作了页面，没有买服务器你只能在本地看看网站，别人是看不了的。
                虽然是一个简单的网站但是也花了我10多天时间，因为我并不擅长设计，
                本来是想做关于新年主题的页面，但是我觉得回忆一下我们恋爱的这段时间经历的一切更有意义，
                希望你能喜欢。
            </p>
            <p>
                自从第一次见到宝宝，我就很喜欢你，喜欢你的笑虽然嘴上不说但是心里还是有点小激动的。那时候的我在淡定也只是个刚出社会的小朋友。
                突然看见这么美美的宝宝怎么会没有点想法呢，无非是我这人并不冲动罢了，因为我觉得感情不能儿戏毕竟这关系到是否会伤害一个女孩子。
                我们在刚刚接触的时候因为大人的插手，我曾经伤害过你3次，让你哭的很伤心，其实你不知道的是那3次，没有一次我不落泪的，其实我们那个时候还不算男女朋友，毕竟我迟钝，并没有向你表白。
                但是我确实是真的第一次感觉到了失去世界的感觉，真的很心疼，并不是心疼自己，也并不恨大人，因为大人考虑的自然有他们的道理，毕竟没有一个父母是不爱自己子女的，
                我心疼的是你，心疼你的伤心，心疼你的哭泣。但是每一次我都忘不掉你，我感觉没有你，我的工作我的生活空了一大片，毫无生机。
                所以我一次又一次的挽回你，每一次当我挽回你的时候，你都很轻易的接受了我，能再一次看见你的笑容内心说不出的满足，
                要不然怎么会有女孩子被说不再联系后这么多次还能轻易的和好呢，我这都还没表白呢，宝宝已经这么伤心了，足以看出宝宝也是喜欢我的，
                所以我决定好好珍惜这段感情，哪怕大人反对，我也觉得不能对不起这段难得的感情。             
                那天晚上我怎么也睡不着觉，拿起手机又不想打扰你休息，所以第一次给你发了一段算是表白的内容，第二天你答应了，我欣喜若狂，当时内心的激动甚至让我想休假一天直接去见你，
                因为在等待你回复的那段时间实在太难熬，我不敢保证你能接受我，毕竟在表白之前我就已经伤害过你，所以我怕你不能接受我，直至我收到答案的一瞬间，我知道整个世界都回来了。
            </p>
            <p>
                在那之后我们正式恋爱了，至今已经1年半了，具体时间宝宝可以看首页的计时器，那就是恋爱天数。这1年半以来我们过的很开心，我们彼此珍惜彼此付出，虽然是异地恋，庆幸的是我们离的并不远，
                越是这样越让我难忘。每一次能见到宝宝的前一天总能让我睡不着觉，太兴奋了，不为其他理由，只因为能陪你度过一个美好的周末。
                虽然在外人看来我们一直相亲相爱，但是不得不说在这1年多来，我们之间也产生过很多矛盾。因为你的事业我们吵过，因为你父母的社保问题我们吵过，因为我妈妈当初的反对我们吵过等等原因。
                但是我想说的是我没有任何看不起你的意思，也没有任何看不起你家人的意思，我只是想为我们的将来考虑，我也怕我妈妈跟我说的那些外地人陋习会让我遇见，所以我想尽一切证明给我妈妈看，我家宝宝不是这样的人，
                我的眼光并没有错。但是等我每一次静下心来去想的时候，我才意识到一个问题，宝宝才20岁，宝宝才20岁，这是我一直忽略的问题，在我的建议下，你自己赚钱省钱去学了美工，去交了学费准备考大学，我还能要求什么呢，
                想想自己20岁的时候还在干嘛。每当我想到这里的时候，我知道我错了，我能想象到你的压力何其大，所以在那以后我也很少在提类似的问题，只想鼓励你，仅仅是希望我的宝宝未来能在社会上有一席之地，
                因为在提升自己的同时你能收获更多，让你更有自信。但是现在的我和以前不一样了，现在我以你的兴趣为主，在不触犯原则的前提下，我在不想逼着宝宝去做这个那个了，那太痛苦了。
            </p>
            <p>
                所以宝宝你也不要生气，我觉得就是因为有这些小吵小闹才更快的促进了我们彼此之间的深入了解，人与人之间各有各的看法，矛盾在所难免，我不会去向你保证以后我绝对不跟你吵架，什么都听你的这种完全不可能实现的诺言，
                恰恰有时候一些小吵小闹能变成感情的催化剂，感情就是在生活的各种经历中慢慢加深的，我非常希望未来每一个困难我们都可以共同去面对，去征服，去走向成功，走向幸福。                
            </p>
            <p>
                说了这么多其实只想告诉宝宝，你现在的男朋友是真的用心在爱你，刚认识我那会儿你应该就知道，我这人并不会太多的甜言蜜语，也不会整天我爱你我爱你的挂在嘴边，
                但并不代表我不爱你，我更希望的是直接将惊喜摆在你面前，用嘴不如用手去做。还有一个重要原因，我们两都还小，特别是你，我不希望你过多的去主动了解爱，因为你还小，还无法诠释爱到底是什么，我也是一样，
                所以我想和宝宝永远走下去，我们可以一起抱着随缘，随遇而安的心态去慢慢摸索爱，享受爱，体验爱，直到我们走到白头，我想让你知道，我对你的爱无处不在，不是那些年龄距离身高学历等任何外在因素可以影响到的。
            </p>
            <p>最后还是那句话，我喜欢你，爱是浓浓的喜欢，让我们怀着初恋的心情甜蜜的牵手走下去。么么哒 ^_^</p>
        </div>
    </el-main>
  </el-container>
</template>

<script>
import LeftSide from './LeftSide'

export default {
  name: 'Sincerity',
  components: {LeftSide}
}

</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
    .since{
        width: 100%;
        height: 100vh;
    }

    .side-bar >>> ul li:nth-child(4) a{
        background: -webkit-linear-gradient(left,transparent,#ff88f5 65%);
    }

    .f-img{
        float: right;
        width: 28%;
        margin-left: 18px;
        margin-bottom: 18px;
    }

    .ex-cont > p{
        font-size: 26px;
        font-weight: bold;
        color: blueviolet;
        line-height: 40px;
        margin-bottom: 20px;
    }

    .love-cont{
        color: #333333;
        font-size: 16px;
    }

    .love-cont > p{
        margin-bottom: 20px;
        text-indent: 2em;
        line-height: 30px;
    }
</style>
